function [dy,dx]=diff_ctr(y,Dt,n)
y1=[y 0 0 0 0 0 0]; y2=[0 y 0 0 0 0 0]; y3=[0 0 y 0 0 0 0];
y4=[0 0 0 y 0 0 0]; y5=[0 0 0 0 y 0 0]; y6=[0 0 0 0 0 y 0];
y7=[0 0 0 0 0 0 y]; %{\rm\,尽量采用向量化运算，准备若干平移的向量}
switch n            %{\rm\,按给定的阶次由开关结构求数值微分}
   case 1, dy=(-y1+8*y2-8*y4+y5)/12/Dt;
   case 2, dy=(-y1+16*y2-30*y3+16*y4-y5)/12/Dt^2;
   case 3, dy=(-y1+8*y2-13*y3+13*y5-8*y6+y7)/8/Dt^3;
   case 4, dy=(-y1+12*y2-39*y3+56*y4-39*y5+12*y6-y7)/6/Dt^4;
end
dy=dy(5+2*(n>2):end-4-2*(n>2)); dx=([2:length(dy)+1]+(n>2))*Dt;
